#### .deploy の結果を表示する。 cb92e75
#### Terraform apply 📖`failure`

<details><summary>Show Apply Result</summary>

```terraform
module.rds.aws_eip.redash_eip: Refreshing state... [id=eipalloc-091e1fbb827e5dc5a]
module.rds.aws_subnet.twitter_db_subnet_1a: Refreshing state... [id=subnet-052605e5211765538]
module.rds.aws_key_pair.mmm3: Refreshing state... [id=mmm3]
module.rds.aws_kms_key.rds_storage: Refreshing state... [id=d665331e-823c-4aad-a0b9-87cbf45c1075]
module.rds.aws_db_option_group.main: Refreshing state... [id=main]
module.rds.aws_route_table.twitter_debug_subnet_rt: Refreshing state... [id=rtb-019e7d0a8b96ff71e]
module.rds.aws_eip.debug_ec2: Refreshing state... [id=eipalloc-0f4fc2b9413ef9653]
module.rds.aws_security_group.free_security_db: Refreshing state... [id=sg-08ac216002d22c4ae]
module.rds.aws_security_group.all_free_security: Refreshing state... [id=sg-05e15c63c4b0700c1]
module.rds.aws_subnet.twitter_db_subnet_1c: Refreshing state... [id=subnet-06f95ab8884244b8b]
module.rds.aws_db_parameter_group.main: Refreshing state... [id=main]
module.rds.aws_route.public_debug_twitter_db: Refreshing state... [id=r-rtb-019e7d0a8b96ff71e1080289494]
module.rds.aws_iam_role.rds_monitoring_role: Refreshing state... [id=rds_monitoring_role]
module.rds.aws_route_table_association.public_debug_twitter_db_1a: Refreshing state... [id=rtbassoc-079b2e798507c5908]
module.rds.aws_iam_role_policy_attachment.default: Refreshing state... [id=rds_monitoring_role-20220504113416421600000001]
module.rds.aws_db_subnet_group.main: Refreshing state... [id=db]
module.rds.aws_instance.rds_debug_ec2_1: Refreshing state... [id=i-035fd01a65e59a40f]
module.rds.aws_route_table_association.public_debug_twitter_db_1c: Refreshing state... [id=rtbassoc-004bdbb57df5bdf07]
module.rds.aws_instance.rds_redash: Refreshing state... [id=i-06060bc13e450e94b]
module.rds.aws_eip_association.eip_assoc_redash: Refreshing state... [id=eipassoc-0cacd366b941de2b1]
module.rds.aws_eip_association.eip_assoc: Refreshing state... [id=eipassoc-053b7b1a0754e064c]
module.rds.aws_db_instance.main: Refreshing state... [id=main]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.rds.aws_db_instance.main has changed
  ~ resource "aws_db_instance" "main" {
        id                                    = "main"
      ~ latest_restorable_time                = "2022-05-04T11:50:44Z" -> "2022-05-04T15:10:00Z"
        name                                  = "twitter_db"
      + security_group_names                  = []
        tags                                  = {
            "Env" = "dev"
        }
        # (48 unchanged attributes hidden)
    }

  # module.rds.aws_db_option_group.main has changed
  ~ resource "aws_db_option_group" "main" {
        id                       = "main"
        name                     = "main"
      + tags                     = {}
        # (5 unchanged attributes hidden)
    }

  # module.rds.aws_db_parameter_group.main has changed
  ~ resource "aws_db_parameter_group" "main" {
        id          = "main"
        name        = "main"
      + tags        = {}
        # (4 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.rds.aws_eip.debug_ec2 has changed
  ~ resource "aws_eip" "debug_ec2" {
      + association_id       = "eipassoc-053b7b1a0754e064c"
        id                   = "eipalloc-0f4fc2b9413ef9653"
      + instance             = "i-035fd01a65e59a40f"
      + network_interface    = "eni-0671a927a41126506"
      + private_dns          = "ip-10-0-4-27.ap-northeast-1.compute.internal"
      + private_ip           = "10.0.4.27"
        tags                 = {
            "Name" = "debug_ec2"
        }
        # (8 unchanged attributes hidden)
    }

  # module.rds.aws_eip.redash_eip has changed
  ~ resource "aws_eip" "redash_eip" {
      + association_id       = "eipassoc-0cacd366b941de2b1"
        id                   = "eipalloc-091e1fbb827e5dc5a"
      + instance             = "i-06060bc13e450e94b"
      + network_interface    = "eni-00285a9eef1672252"
      + private_dns          = "ip-10-0-4-11.ap-northeast-1.compute.internal"
      + private_ip           = "10.0.4.11"
        tags                 = {
            "Name" = "debug_ec2"
        }
        # (8 unchanged attributes hidden)
    }

  # module.rds.aws_iam_role.rds_monitoring_role has changed
  ~ resource "aws_iam_role" "rds_monitoring_role" {
        id                    = "rds_monitoring_role"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole",
        ]
        name                  = "rds_monitoring_role"
      + tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.rds.aws_instance.rds_debug_ec2_1 has changed
  ~ resource "aws_instance" "rds_debug_ec2_1" {
        id                                   = "i-035fd01a65e59a40f"
      ~ public_dns                           = "ec2-13-231-127-183.ap-northeast-1.compute.amazonaws.com" -> "ec2-35-72-197-131.ap-northeast-1.compute.amazonaws.com"
      ~ public_ip                            = "13.231.127.183" -> "35.72.197.131"
        tags                                 = {
            "Name" = "rds_debug_ec2_1"
        }
        # (27 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # module.rds.aws_instance.rds_redash has changed
  ~ resource "aws_instance" "rds_redash" {
        id                                   = "i-06060bc13e450e94b"
      ~ public_dns                           = "ec2-103-4-11-136.ap-northeast-1.compute.amazonaws.com" -> "ec2-52-199-86-144.ap-northeast-1.compute.amazonaws.com"
      ~ public_ip                            = "103.4.11.136" -> "52.199.86.144"
        tags                                 = {
            "Name" = "redash"
        }
        # (27 unchanged attributes hidden)






        # (6 unchanged blocks hidden)
    }

  # module.rds.aws_key_pair.mmm3 has changed
  ~ resource "aws_key_pair" "mmm3" {
        id          = "mmm3"
      + tags        = {}
        # (6 unchanged attributes hidden)
    }

  # module.rds.aws_route_table.twitter_debug_subnet_rt has changed
  ~ resource "aws_route_table" "twitter_debug_subnet_rt" {
        id               = "rtb-019e7d0a8b96ff71e"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-07adf71781ae87ed1"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "twitter_debug_subnet_rt-public"
        }
        # (5 unchanged attributes hidden)
    }

  # module.rds.aws_security_group.all_free_security has changed
  ~ resource "aws_security_group" "all_free_security" {
        id                     = "sg-05e15c63c4b0700c1"
        name                   = "all_free_security"
      + tags                   = {}
        # (8 unchanged attributes hidden)
    }

  # module.rds.aws_security_group.free_security_db has changed
  ~ resource "aws_security_group" "free_security_db" {
        id                     = "sg-08ac216002d22c4ae"
        name                   = "no_security"
      + tags                   = {}
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_elasticsearch_domain.discord_log will be created
  + resource "aws_elasticsearch_domain" "discord_log" {
      + access_policies       = (known after apply)
      + advanced_options      = (known after apply)
      + arn                   = (known after apply)
      + domain_id             = (known after apply)
      + domain_name           = "discord-log"
      + elasticsearch_version = "7.10"
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + kibana_endpoint       = (known after apply)
      + tags                  = {
          + "Domain" = "discord-log"
        }
      + tags_all              = {
          + "Domain" = "discord-log"
        }

      + advanced_security_options {
          + enabled                        = (known after apply)
          + internal_user_database_enabled = (known after apply)

          + master_user_options {
              + master_user_arn      = (known after apply)
              + master_user_name     = (known after apply)
              + master_user_password = (sensitive value)
            }
        }

      + auto_tune_options {
          + desired_state       = (known after apply)
          + rollback_on_disable = (known after apply)

          + maintenance_schedule {
              + cron_expression_for_recurrence = (known after apply)
              + start_at                       = (known after apply)

              + duration {
                  + unit  = (known after apply)
                  + value = (known after apply)
                }
            }
        }

      + cluster_config {
          + dedicated_master_enabled = false
          + instance_count           = 1
          + instance_type            = "r4.large.elasticsearch"
        }

      + domain_endpoint_options {
          + custom_endpoint                 = (known after apply)
          + custom_endpoint_certificate_arn = (known after apply)
          + custom_endpoint_enabled         = (known after apply)
          + enforce_https                   = (known after apply)
          + tls_security_policy             = (known after apply)
        }

      + ebs_options {
          + ebs_enabled = (known after apply)
          + iops        = (known after apply)
          + volume_size = (known after apply)
          + volume_type = (known after apply)
        }

      + encrypt_at_rest {
          + enabled    = (known after apply)
          + kms_key_id = (known after apply)
        }

      + node_to_node_encryption {
          + enabled = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_elasticsearch_domain.discord_log: Creating...

```

</details>

<details><summary>Error</summary>

  ```terraform
  
Error: Error creating Elasticsearch domain: ValidationException: EBS storage must be selected for r4.large.elasticsearch

  with aws_elasticsearch_domain.discord_log,
  on main.tf line 26, in resource "aws_elasticsearch_domain" "discord_log":
  26: resource "aws_elasticsearch_domain" "discord_log" {


  ```

  </details>
